Repository: RaphSanchez/Flix-Manager
Catalog: BlazorMovies/Shared/Resources/IndexResources.*.resx
Languages: es_mx

# Index1.1
source: Flix Manager is a progressive web application to manage a library of movies that illustrates, from the ground up, all the major topics that any aspiring full stack .Net
es_mx: Flix Manager es una aplicación web progresiva para administrar una biblioteca de películas que ilustra, desde cero, todos los temas principales que debe conocer cualquier aspirante a desarrollador full stack en .Net

# Index1.2
source: developer should be familiar with. It lays out a background, explains, provides data sources, and demonstrates the practical implementation of each subject.
es_mx: . Establece un antecedente, explica, proporciona fuentes de datos y demuestra la implementación práctica de cada tema.

# Index2.1
source: Flix Manager was born in my journey to transition from a desktop applications to a web applications developer and I sincerely hope it is of some use to other fellow developers that wish to make the same progression. Its instructional section is a collection of data from multiple sources curated with a zero experience developer in mind to aid in his/her passage to become a full stack .Net Blazor developer.
es_mx: Flix Manager nació en mi viaje de transición como desarrollador de aplicaciones de escritorio a desarrollador de aplicaciones web y espero sinceramente que sea de alguna utilidad para otros colegas desarrolladores que deseen hacer la misma progresión. La sección pedagógica es una colección de datos de múltiples fuentes seleccionados con un desarrollador en mente sin absolutamente ninguna experiencia para ayudarlo a convertirse en desarrollador full stack de .Net Blazor.

# Index3.1
source: I chose an application to manage a library of movies because there are plenty of similar projects and data from
es_mx: Elegí una aplicación para administrar una biblioteca de películas porque hay muchos proyectos similares e información que se puede encontrar en

# Index3.2
source: (the creator of
es_mx: (el creador de

# Index3.3
source: and
es_mx: y

# Index3.4
source: This makes it fairly trouble-free to research diverse approaches to achieve the ultimate goal of producing a progressive web application that adheres to the current industry standards.
es_mx: Esto hace que sea bastante fácil investigar diversos enfoques para lograr el objetivo final de producir una aplicación web progresiva que se apegue a los estándares actuales de la industria.

# Index4.1
source: Although the outline of the subjects in the development of the Flix Manager application is based on the
es_mx: Aunque la tabla de contenido de los temas en el desarrollo de la aplicación Flix Manager se basa en el curso

# Index4.2
source: course by Felipe Gavilán, its implementation is heavily modified. Specially as it moves forward towards the more advanced topics. Nevertheless, I
es_mx: por Felipe Gavilán, su implementación está significativamente modificada. Especialmente conforme se va progresando hacia los temas más avanzados. Sin embargo, recomiendo

# Index4.3
source: strongly
es_mx: enfáticamente

# Index4.4
source: recommend checking out his course at
es_mx: consultar su curso en

# Index5.0
source: Architecture
es_mx: Arquitectura

# Index6.0
source: The graphical user interface of Flix Manager is divided into three main sections:
es_mx: La interfaz gráfica de usuario de Flix Manager se divide en tres secciones principales:

# Index7.1
source: 1. Horizontal Navigation Bar on Top
es_mx: 1. Barra Horizontal de Navegación en la Parte Superior:

# Index7.10
source: The "Register", "Log in", and "Log out" links are the representation of the
es_mx: Los enlaces the "Register" (Registro), "Log in" (Iniciar sesión), y "Log out" (Cerrar sesión) son la representación del módulo de

# Index7.11
source: security
es_mx: seguridad

# Index7.12
source: module that controls access to different application resources based on the authorization credentials used to
es_mx: que controla el acceso a los diferentes recursos de la aplicación en función de las credenciales de autorización utilizadas para

# Index7.13
source: register
es_mx: registro

# Index7.14
source: login
es_mx: iniciar sesión

# Index7.15
source: or logout an application user.
es_mx: o cerrar la sesión de un usuario de la aplicación.

# Index7.16
source: The registration process includes
es_mx: El proceso de registro incluye

# Index7.17
source: account confirmation
es_mx: confirmación de la cuenta

# Index7.18
source: and has options such as:
es_mx: y tiene opciones como:

# Index7.19
source: Enabling
es_mx: Habilitación de la

# Index7.2
source: Top level navigation bar found at the very top of the graphical user interface.
es_mx: Barra de navegación de nivel superior que se encuentra en la parte superior de la interfaz gráfica de usuario.

# Index7.20
source: two factor authentication
es_mx: autenticación de dos factores

# Index7.21
source: to increase security.
es_mx: para aumentar la seguridad.

# Index7.22
source: Application user authentication with
es_mx: Autenticación de usuario de la aplicación con

# Index7.23
source: external ID providers
es_mx: proveedores de identificación externos

# Index7.24
source: such as Google and Facebook.
es_mx: como Google y Facebook.

# Index7.25
source: It is the doorway to an application user's
es_mx: Es la puerta de entrada al

# Index7.26
source: personal profile
es_mx: perfil personal

# Index7.27
source: to access, download, update, or delete your account information at any time.
es_mx: de un usuario de la aplicación para acceder, descargar, actualizar o eliminar la información de su cuenta en cualquier momento.

# Index7.3
source: In order of appearance:
es_mx: En orden de aparición:

# Index7.4
source: The bell icon allows the user to subscribe to the
es_mx: El ícono en forma de campana permite al usuario suscribirse al

# Index7.5
source: web push notification service
es_mx: servicio de notificaciones web push

# Index7.6
source: The drop down menu is the implementation of
es_mx: El menú desplegable es la implementación de

# Index7.7
source: internationalization
es_mx: internacionalización

# Index7.8
source: which retrieves your web browser's language preferences to display the web page content in the same language when available.
es_mx: que obtiene las preferencias de idioma del navegador web para mostrar el contenido de la página en el mismo idioma cuando esté disponible.

# Index7.9
source: The drop down control allows the user to override the web browser's preferences and select the language of choice. This is just for demonstration purposes and it is not available everywhere in the application.
es_mx: El menú desplegable permite al usuario ignorar las preferencias del navegador web y seleccionar el idioma manualmente. Esto es sólo para fines de demostración por lo que no está disponible en todas las áreas.

# Index8.1
source: 2. Flix Manager Menu
es_mx: 2. Menú de Flix Manager

# Index8.10
source: delete
es_mx: eliminar

# Index8.11
source: movies, actors, and genres.
es_mx: películas, actores y géneros.

# Index8.12
source: filters
es_mx: filtros

# Index8.13
source: and
es_mx: y

# Index8.14
source: Test authorized operations based on the
es_mx: Probar actividades autorizadas basadas en las

# Index8.15
source: authorization claims
es_mx: aserciones de autorización

# Index8.16
source: of built-in
es_mx: de previamente cargados

# Index8.17
source: application users
es_mx: usuarios de la aplicación

# Index8.18
source: Guest
es_mx: Invitado

# Index8.19
source: User has access to most of the available sections but is not allowed to perform create, update, or delete operations.
es_mx: El usuario tiene acceso a la mayoría de las secciones disponibles pero no puede realizar operaciones de creación, actualizacíon o eliminación.

# Index8.2
source: Top level navigation menu item found right at the top of the vertical navigation bar on the left column of the graphical user interface.
es_mx: Elemento de nivel superior del menú de navegación que se encuentra justo en el tope superior de la barra vertical de navegación en la columna de lado izquierdo de la interfaz gráfica del usuario.

# Index8.20
source: Guest user login info
es_mx: Información de acceso de usuario invitado

# Index8.21
source: User
es_mx: Usuario

# Index8.22
source: Password
es_mx: Contraseña

# Index8.23
source: Creator
es_mx: Creador

# Index8.24
source: User has access to most of the available sections and is allowed to perform create but not edit or delete operations.
es_mx: El usuario tiene acceso a la mayoría de las secciones disponibles y puede realizar operaciones para añadir pero no para actualizar o eliminar información.

# Index8.25
source: Creator user login info
es_mx: Información de acceso de usuario creador

# Index8.26
source: Administrator
es_mx: Administrador

# Index8.27
source: User has administrator privileges to access all the features available including editing other user's permissions.
es_mx: El usuario tiene privilegios de administrador para acceder a todas las secciones y funciones disponibles incluyendo la edición de los permisos de otros usuarios.

# Index8.28
source: Login info for
es_mx: Información de acceso de usuario

# Index8.3
source: Provides access to the operational module. This is where you can make use of most of the application features.
es_mx: Proporciona acceso al módulo operativo. Aquí es dónde se puede hacer uso de la mayoría de las funciones de la aplicación.

# Index8.4
source: Some examples of the available operations are:
es_mx: Algunos ejemplos de las operaciones disponibles son:

# Index8.5
source: Search using
es_mx: Búsqueda utilizando

# Index8.6
source: pagination
es_mx: paginación

# Index8.7
source: add
es_mx: añadir

# Index8.8
source: update
es_mx: actualizar

# Index8.9
source: and/or
es_mx: y/o

# Index9.1
source: 3. Nav Menu Items 01 to 13
es_mx: 3. Elementos del Menú de Navegación 01 a 13

# Index9.10
source: installed
es_mx: instalada

# Index9.11
source: into the start menu, dock, or home screen depending on the web browser used and the operating system in which it used (e.g., Windows, macOS, iOS, or Android).
es_mx: en el menú de inicio o la pantalla de inicio, según el navegador web utilizado y el sistema operativo en el que se utiliza (ej. Windows, macOs, iOS o Android).

# Index9.12
source: Typically, you will see an icon next to the web browser's address bar to install the application.
es_mx: Por lo general, habrá un ícono junto a la barra de direcciones del navegador web para instalar la aplicación.

# Index9.13
source: It progressively establishes offline support attending the most frequently visited areas by the user.
es_mx: Establece progresivamente soporte fuera de línea atendiendo las áreas de la aplicación más visitadas por el usuario.

# Index9.14
source: Feel free to play around and experiment every scenario you can imagine without hesitation. There is a
es_mx: Se puede experimentar con prácticamente cualquier escenario sin problemas ya que se proporciona un botón denominado

# Index9.15
source: button element in the
es_mx: en el componente enrutable

# Index9.16
source: routable component that completely wipes out all the data and resets the database into its initial state.
es_mx: que borra por completo toda la información y reestablece la base de datos a su estado inicial.

# Index9.17
source: The
es_mx: La aplicación web progresiva

# Index9.18
source: progressive web application was not created with a focus on the design of the graphical user interface to keep things as simple as the requirements permit. The focus was primarily on the architecture of the source code and the way the components interact with each other (structure).
es_mx: no fue creada con un enfoque en el diseño de la interfaz gráfica para mantener los temas tan simple como sea posible. La atención se centró principalmente en la arquitectura del código fuente y la forma en que los componentes interactúan entre sí (estructura).

# Index9.2
source: Top level navigation menu items found right below Flix Manager in the vertical navigation bar on the left column of the graphical user interface.
es_mx: Elementos de nivel superior de navegación que se encuentran justo debajo de Flix Manager en la barra de navegación vertical en la columna de lado izquierdo de la interfaz gráfica del usuario.

# Index9.3
source: Nav menu items provide access to the instructional module of the application. This is where we demonstrate how to implement each of the features available in the operational sections of the graphical user interface cited earlier.
es_mx: Los elementos del menú de navegación brindan acceso al módulo pedagógico de la aplicación. Aquí es donde se demuestra cómo implementar cada una de las funciones disponibles en las secciones operativas de la interfaz gráfica citadas anteriormente.

# Index9.4
source: Each top level navigation menu has an introduction to the topic and includes submenus that slowly progress from the fundamental concepts to the more advanced implementations.
es_mx: Cada elemento de nivel superior de navegación cuenta con una introducción al tema e incluye submenús que comprenden desde los conceptos fundamentales hasta las imiplementaciones más avanzadas.

# Index9.5
source: Final Notes
es_mx: Notas Finales

# Index9.6
source: is a
es_mx: es una

# Index9.7
source: progressive web application
es_mx: aplicación web progresiva

# Index9.8
source: and as such, it can behave like a desktop (or native) application. For example,
es_mx: y como tal, puede comportarse como una aplicación de escritorio (o nativa). Por ejemplo,

# Index9.9
source: It can be
es_mx: Puede ser

# MainHeader
source: Flix Manager Progressive Web App
es_mx: Flix Manager Aplicación Web Progresiva

source: Preface
es_mx: Prefacio
